:PROPERTIES:
:header-args:emacs-lisp: :tangle config.el :noweb yes :results silent :lexical yes :comments noweb
:END:
#+title: Carson's Emacs Config
****** Hyperspace Jira Query
#+begin_src emacs-lisp :noweb-ref hyperspace-jira :tangle no
(defvar ch/hyperspace-atlassian-url
  "https://wwuhelp.atlassian.net"
  "The site for the atlassian related actions")

(defvar ch/hyperspace-jira-issue-default-ordering
  "ORDER BY statusCategory ASC, priority DESC, updated DESC"
  "The default ordering for issues in jira queries")

(defconst ch/hyperspace-jira-issue-containing-text
  "AND text ~ \'%s\'")

(defun hyperspace-action->jira-issues-with-query (conditions &optional query &key ordering)
  "docstring"
  (interactive "P")
  (let ((ordering (or ordering ch/hyperspace-jira-issue-default-ordering)))
  (hyperspace-action->browse-url-pattern
   (concat
    ch/hyperspace-atlassian-url
    "/issues/?filter=-1&jql="
    conditions
    " "
    (when query
      (message query)
      ch/hyperspace-jira-issue-containing-text)
    " "
    ordering
    )
   query
   )))
#+end_src

#+RESULTS:
: hyperspace-action->jira-issues-with-query

